tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "cloudfoundry/tap"
tap "romkatv/powerlevel10k"
tap "Rigellute/tap"
tap "spring-io/tap"
tap "hashicorp/tap" 

#Cask taps
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
#tap "AdoptOpenJDK/openjdk"

# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat" 
# Encoding tool
brew "ffmpeg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Distributed revision control system
brew "git"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Programatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Powerline10k
brew "romkatv/powerlevel10k/powerlevel10k"
# Terminal Multiplexer
brew "tmux"
#Cloud Foundry CLI V6
brew "cloudfoundry/tap/cf-cli"
#Cloud Foundry CLI V7
brew "cloudfoundry/tap/cf-cli@7"
# Show System information
brew "neofetch"
# Like top but written in go 
brew "gotop"
# Update bash  
brew "bash"
# ruby version manager
brew "rbenv"
# bash ShellCheck 
brew "shellcheck"
# gopass: cli-based secret manager
brew "gopass"
# openconnect vpn
brew "openconnect"
# Kubernetes CLI
brew "kubernetes-cli"
# Maven
brew "maven"
# Gradle
brew "gradle"
# Graphviz for PlantUML
brew "graphviz"
# Spring Boot CLI
brew "spring-boot"
# Terraform
brew "hashicorp/tap/terraform"
# Redis
brew "redis"
# podman
brew "podman"

# Cask applications
cask "dash"
cask "docker"
cask "firefox"
#cask "google-chrome"
#cask "brave-browser"
#cask "waterfox"
cask "iterm2"
cask "warp" # https://www.warp.dev/
cask "microsoft-edge"
cask "microsoft-teams"
cask "postman"
cask "spotify"
cask "sonos"
cask "slack"
#cask "telegram"
cask "signal"
cask "visual-studio-code"
cask "intellij-idea"
cask "vlc"
cask "whatsapp"
cask "enpass"
cask "logitech-options"
cask "logi-options-plus"
cask "rectangle"
cask "deepl"
cask "discord"
cask "gimp"
cask "calibre"
cask "drawio"
cask "powershell"

# hides notch, https://topnotch.app
cask "topnotch"

# Java AdoptOpenJDK version
# https://github.com/AdoptOpenJDK/homebrew-openjdk
# cask "adoptopenjdk16"

# JDK Eclipse Temurin
cask "temurin"

# macOS system monitor in your menu bar, https://github.com/exelban/stats
cask "stats"

# Keep your audio balance from drifting! OSX Status Bar App, https://github.com/jamsinclair/ballast
cask "ballast"

# Control Monitor brightness & volume, https://github.com/MonitorControl/MonitorControl
cask "monitorcontrol"

# Your next meeting always before your eyes in the macOS menu bar, https://github.com/leits/MeetingBar
cask "meetingbar"

# A simple tool to calculate the overall performance of an investment portfolio. https://github.com/buchen/portfolio
cask "portfolioperformance" 

# Special usb driver for minix usb-c hub
#cask "asix-ax88179"

# Fonts
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"
cask "font-victor-mono"

#mas "Keynote", id: 409183694
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "Amphetamine", id: 937984704
#mas "All-in-One Messenger", id: 1456462087
mas "Microsoft To Do", id: 1274495053

# Microsoft Office, Word, Excel, PP, onedrive, outlook
cask "microsoft-office"
